# Loading data

In [1]:
import pandas as pd
import numpy as np

## pandas.Series

`Series` one dimensional array containing data and index, the same as one column in excel table.

In [2]:
age = pd.Series([19, 25, 18, 29], index=['Anna', 'Emily', 'Hannah', 'Julie'])

In [3]:
type(age)

pandas.core.series.Series

In [4]:
age

Anna      19
Emily     25
Hannah    18
Julie     29
dtype: int64

In [5]:
age.index

Index(['Anna', 'Emily', 'Hannah', 'Julie'], dtype='object')

In [6]:
age.values

array([19, 25, 18, 29])

In [7]:
age.sort_values()

Hannah    18
Anna      19
Emily     25
Julie     29
dtype: int64

In [8]:
age.subtract(18)

Anna       1
Emily      7
Hannah     0
Julie     11
dtype: int64

In [9]:
temperature = pd.Series([8.0, 7.5, -1.0, 2.0], ['2018-12-03','2018-12-04','2018-12-05','2018-12-06'])
temperature.index.name = 'date'
temperature.name = 'Temperature'

In [10]:
type(temperature)

pandas.core.series.Series

In [11]:
temperature

date
2018-12-03    8.0
2018-12-04    7.5
2018-12-05   -1.0
2018-12-06    2.0
Name: Temperature, dtype: float64

In [12]:
print(f'Mean Temperature = {temperature.mean()}')
print(f'Median Temperature = {temperature.median()}')
print(f'Standard Deviation in Temperature = {temperature.std():.2f}')

Mean Temperature = 4.125
Median Temperature = 4.75
Standard Deviation in Temperature = 4.37

In [13]:
temperature.subtract(temperature.mean())

date
2018-12-03    3.875
2018-12-04    3.375
2018-12-05   -5.125
2018-12-06   -2.125
Name: Temperature, dtype: float64

### `Series` has attributes and methods

In [14]:
age.name = 'agee' # name is an attribute

In [15]:
age = age.rename('age') # rename is method

In [16]:
age

Anna      19
Emily     25
Hannah    18
Julie     29
Name: age, dtype: int64

### Loading data from `dict`

In [17]:
movies = {
    'Pavla':'Star Wars', 'Peter':'Star Trek', 'Jakub':'Star Wars', 'Claire':'Star Wars', 
    'Carol':'Star Trek', 'David':'Star Trek', 'Jan':'Star Trek', 'Filip':'Star Trek', 
    'Daniel':'Star Trek', 'Michaela':'Star Wars', 'James':'Star Trek'
}
movies_series  = pd.Series(movies)
movies_series

Pavla       Star Wars
Peter       Star Trek
Jakub       Star Wars
Claire      Star Wars
Carol       Star Trek
David       Star Trek
Jan         Star Trek
Filip       Star Trek
Daniel      Star Trek
Michaela    Star Wars
James       Star Trek
dtype: object

### Accessing elements of  `Series`

In [18]:
age[0]

19

In [19]:
age['Anna']

19

### Exercise

Create `pandas.Series` from the list of exam scores `[12, 33, 23, 15, 67]` for `['John', 'Emily', 'Jack', 'David', 'Matthew']`

1. Add name 'scores' attribute to it
2. Extract second element and store it as an variable
3. Extract Jack's exam scores

In [20]:
scores = pd.Series([12, 33, 23, 15, 67],index=['John', 'Emily', 'Jack', 'David', 'Matthew'])

In [21]:
scores.name= "scores"

In [22]:
emage=scores[1]
emage

33

In [23]:
scores['Jack']

23

###  `Series` as array

In [24]:
age = pd.Series([19, 25, 18, 29], index=['Anna', 'Emily', 'Hannah', 'Julie'])

In [25]:
age.median()

22.0

In [26]:
age[age > age.median()]

Emily    25
Julie    29
dtype: int64

### Vector operation with `Series`

In [27]:
# Number of sold ice cream scoops
ice_cream1 = pd.Series([30, 45, 55, 65], index=[
    'Chocolate', 'Strawberry', 'Vanilla', 'Straciatella'
])

In [28]:
# Number of sold scoops after campaign
ice_cream2 = pd.Series([110, 120, 150, 175], index=[
    'Chocolate', 'Strawberry', 'Vanilla', 'Straciatella'
])

In [29]:
ice_cream2 - ice_cream1

Chocolate        80
Strawberry       75
Vanilla          95
Straciatella    110
dtype: int64

In [30]:
# If each scoop costs 35 CZK, how much money did we get?
price = 35
price * ice_cream1

Chocolate       1050
Strawberry      1575
Vanilla         1925
Straciatella    2275
dtype: int64

In [31]:
# What if strawberry costs 40 CZK, how much did we get for it?
price * ice_cream1['Strawberry']

1575

### Exercise

Write a function that compares if the elements of the first `pandas.Series` are greater than elements of the second `pandas.Series` and print the number of times it is true.

In [32]:
def compare_series(series1:pd.Series, series2:pd.Series):
    print(sum(series1 > series2))

In [33]:
compare_series(ice_cream2, ice_cream1)
compare_series(ice_cream1, ice_cream2)

4
0

## DataFrame

Two-dimensional data structure containing indexed rows and columns, the same as excel table.

`DataFrame` can be created from `dict`, nested list, several `Series`, another `DataFrame`, etc.

In [34]:
movies = {
    'Pavla':'Star Wars', 'Peter':'Star Trek', 'Jakub':'Star Wars', 'Claire':'Star Wars', 
    'Carol':'Star Trek', 'David':'Star Trek', 'Jan':'Star Trek', 'Filip':'Star Trek', 
    'Daniel':'Star Trek', 'Michaela':'Star Wars', 'James':'Star Trek'
}
movies_df = pd.DataFrame(movies, index = range(0, len(movies)))

In [35]:
movies_df

,Pavla,Peter,Jakub,Claire,Carol,David,Jan,Filip,Daniel,Michaela,James
0,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
1,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
2,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
3,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
4,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
5,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
6,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
7,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
8,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
9,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek
10,Star Wars,Star Trek,Star Wars,Star Wars,Star Trek,Star Trek,Star Trek,Star Trek,Star Trek,Star Wars,Star Trek

In [36]:
# Not quite the way we wanted, let's specify that the data orientation is index
movies_df2 = pd.DataFrame.from_dict(movies, orient = 'index')
movies_df2

                  0
Pavla     Star Wars
Peter     Star Trek
Jakub     Star Wars
Claire    Star Wars
Carol     Star Trek
David     Star Trek
Jan       Star Trek
Filip     Star Trek
Daniel    Star Trek
Michaela  Star Wars
James     Star Trek

In [37]:
movies_df2.reset_index(inplace = True)

In [38]:
movies_df2

       index          0
0      Pavla  Star Wars
1      Peter  Star Trek
2      Jakub  Star Wars
3     Claire  Star Wars
4      Carol  Star Trek
5      David  Star Trek
6        Jan  Star Trek
7      Filip  Star Trek
8     Daniel  Star Trek
9   Michaela  Star Wars
10     James  Star Trek

In [39]:
movies_df2.columns = ['Name', 'Movie']

In [40]:
movies_df2.head()

     Name      Movie
0   Pavla  Star Wars
1   Peter  Star Trek
2   Jakub  Star Wars
3  Claire  Star Wars
4   Carol  Star Trek

In [41]:
movies_df2.tail()

        Name      Movie
6        Jan  Star Trek
7      Filip  Star Trek
8     Daniel  Star Trek
9   Michaela  Star Wars
10     James  Star Trek

In [42]:
ice_cream1 = pd.Series([30, 45, 55, 65], 
                       index=['Chocolate', 'Strawberry', 'Vanilla', 'Straciatella'], 
                       name = '2017'
)
ice_cream2 = pd.Series([110, 120, 150, 175], 
                       index=['Chocolate', 'Strawberry', 'Vanilla', 'Straciatella'],
                      name = '2018'
) 
ice_cream_df = pd.concat([ice_cream1, ice_cream2], axis=1)
ice_cream_df

              2017  2018
Chocolate       30   110
Strawberry      45   120
Vanilla         55   150
Straciatella    65   175

In [43]:
ice_cream_df.describe()

            2017        2018
count   4.000000    4.000000
mean   48.750000  138.750000
std    14.930394   29.545163
min    30.000000  110.000000
25%    41.250000  117.500000
50%    50.000000  135.000000
75%    57.500000  156.250000
max    65.000000  175.000000

In [44]:
import datetime
np.datetime64('2012-06-18T02:00:06.453000000')-np.datetime64('2012-06-18T02:00:05.453000000')

numpy.timedelta64(1000000000,'ns')

In [45]:
datetime.datetime(2018,10,12,8,0,0)

datetime.datetime(2018, 10, 12, 8, 0)

In [46]:
np.datetime64('2012-06-18T02:00:05.453000000')

numpy.datetime64('2012-06-18T02:00:05.453000000')

### Exercise

Create `pandas.DataFrame` from the data from previous exercise (scores`[12, 33, 23, 15, 67]` for `['John', 'Emily', 'Jack', 'David', 'Matthew']`).

1. Add column names = `Scores` and `Name`
2. Compute descriptive statistics for `Scores` column

In [47]:
scores = pd.Series([12, 33, 23, 15, 67], index=['John', 'Emily', 'Jack', 'David', 'Matthew'])
scores_df = pd.DataFrame(scores)
scores_df.reset_index(inplace=True)
scores_df.columns = ['Name', 'Score']
scores_df

      Name  Score
0     John     12
1    Emily     33
2     Jack     23
3    David     15
4  Matthew     67

In [52]:
scores_df.describe()
# or specify the column with scores_df.Score.describe() to be precise

           Score
count   5.000000
mean   30.000000
std    22.226111
min    12.000000
25%    15.000000
50%    23.000000
75%    33.000000
max    67.000000

## Loading data

In [49]:
import pandas as pd
import numpy as np

#### CSV import

In [50]:
wolf_data = pd.read_csv(
    'http://vincentarelbundock.github.io/Rdatasets/csv/carData/Depredations.csv', index_col = 0
)
wolf_data.head()

   longitude  latitude  number  early  late
1      -94.5      46.1       1      0     1
2      -93.0      46.6       2      0     2
3      -94.6      48.5       1      1     0
4      -92.9      46.6       2      0     2
5      -95.9      48.8       1      0     1

#### Clipboard import

In [56]:
data_clipboard = pd.read_clipboard()
data_clipboard

PyperclipException:
    Pyperclip could not find a copy/paste mechanism for your system.
    For more information, please visit https://pyperclip.readthedocs.org

####  TXT and TSV table import

In [ ]:
titanic_train = pd.read_table(
    'http://www.statsci.org/data/general/titanic.txt')
titanic_train.head()

#### JSON import

Data from Czech hydrometeorological institute - air quality

We want to extract various air quality measurements from different parts of Czech republic and then load them as `DataFrame`.

In [ ]:
import requests

In [ ]:
response = requests.get('http://portal.chmi.cz/files/portal/docs/uoco/web_generator/aqindex_cze.json')
chmi_air = response.json()
chmi_air

In [ ]:
czech = [state for state in chmi_air['States'] if state['Code'] == 'CZ']
czech[0]

In [ ]:
stations = []
for r in czech[0]['Regions']:
    for s in r['Stations']:
        row = {'Station': s['Name'], 'Region': r['Name']}
        for c in s.get('Components', []):
            if 'Val' in c:
                row[c['Code']] = c['Val']
        stations.append(row)
air_pollution = pd.DataFrame.from_records(stations, index=['Region', 'Station'])
air_pollution.head()

### Titanic data

In [ ]:
titanic = pd.read_excel('http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls')
titanic.head()

### Bonus: hell with excel

Data from [Czech statistical office](https://www.czso.cz/csu/gender/2-gender_obyvatelstvo)

First marriages: by age of groom and bride

In order to make these table look more like tidy data:

1. Exclude empty rows in the beginning of the table
2. Make nice header
3. Exclude Czech names in header and index column

In [ ]:
link = 'https://www.czso.cz/documents/10180/32853391/300002161106.xlsx/6bcf2981-2bf8-40c5-aac6-cefbf3034783?version=1.1'
pd.read_excel(link)

In [ ]:
pd.read_excel(link, header = 5)

In [ ]:
data = pd.read_excel(link, header = None, index_col = 0, skiprows = 4)
data

In [ ]:
data.iloc[0]

In [ ]:
data.iloc[5]

In [ ]:
col1 = data.iloc[0].fillna(method = 'ffill')
col2 = data.iloc[1].str.split(pat='\n', n = 0).str.get(1)
columns = [col1, col2]

columns = list(zip(*columns))

In [ ]:
data.columns = columns
data = data.drop(data.index[[0,1,2]])
data

In [ ]:
data.head()

In [ ]:
data.index.str.replace('Celkem\n', '')

In [ ]:
data.index = data.index.str.replace('Celkem\n', '')

In [ ]:
data.head()